package lib;

import io.appium.java_client.AppiumDriver;

public class TrCardDataMethods extends TrCardCoreMethods
{

    public TrCardDataMethods(AppiumDriver driver)
    {
        super(driver);
    }

    /* Хранение и выдача значений некоторых параметров карт из "боевой" базы данных */
    public String[][] getRealCardParameters()
    {
        // 0 - последние 4 цифры номера карты
        // 1 - возможность пополнения карты (Y / N) - counterReplenishment.allowed
        // 2 - возможность подключения услуг к карте (Y / N) - servicePurchase.allowed
        String[][] real_card_parameters = {
                {"2484", "", ""}, {"1672", "", ""}, {"0992", "", ""}, {"4636", "", ""}, {"1375", "", ""},
                {"8682", "", ""}, {"0133", "", ""}, {"3568", "", ""}, {"6090", "", ""}, {"5451", "", ""},
                {"0509", "", ""}, {"3568", "", ""}, {"8265", "", ""}, {"8306", "", ""}, {"8314", "", ""},
                {"8322", "", ""}, {"8348", "", ""}, {"5210", "", ""}, {"8890", "", ""}, {"7659", "", ""},
                {"3637", "", ""}, {"5704", "", ""}, {"8831", "", ""}, {"4690", "", ""}, {"1023", "", ""},
                {"1243", "", ""}, {"9732", "", ""}, {"6784", "", ""}, {"6842", "", ""}, {"8020", "", ""},
                {"8938", "", ""}, {"9566", "", ""}, {"5338", "", ""}, {"0571", "", ""}, {"8411", "", ""},
                {"0040", "", ""}, {"6895", "", ""}, {"2599", "", ""}, {"1090", "", ""}, {"7062", "", ""},
                {"0245", "", ""}, {"2415", "", ""}, {"2220", "", ""}, {"2907", "", ""}, {"8786", "", ""},
                {"0429", "", ""}, {"6319", "", ""}, {"2772", "", ""}, {"5015", "", ""}, {"0030", "", ""},
                {"5664", "", ""}, {"0138", "", ""}, {"5869", "", ""}, {"0148", "", ""}, {"6655", "", ""},
                {"4486", "", ""}, {"4635", "", ""}, {"6538", "", ""}, {"8195", "", ""}, {"3040", "", ""},
                {"6463", "", ""}, {"7151", "", ""}, {"2975", "", ""}, {"7396", "", ""}, {"4573", "", ""},
                {"6873", "", ""}, {"7903", "", ""}, {"2325", "", ""}, {"2256", "", ""}, {"3591", "", ""},
                {"6367", "", ""}, {"0987", "", ""}, {"1308", "", ""}, {"6994", "", ""}, {"3906", "", ""},
                {"0650", "", ""}, {"1278", "", ""}, {"2374", "", ""}, {"0039", "", ""}, {"8939", "", ""},
                {"0457", "", ""}, {"7476", "", ""}, {"1052", "", ""}, {"8258", "", ""}, {"9744", "", ""},
                {"4209", "", ""}, {"2117", "", ""}, {"7395", "", ""}, {"7452", "", ""}, {"4377", "", ""},
                {"6283", "", ""}, {"4240", "", ""}, {"1594", "", ""}, {"0111", "", ""}, {"7552", "", ""},
                {"6246", "", ""}, {"2744", "", ""}, {"8939", "", ""}, {"9334", "", ""}, {"2857", "", ""},
                {"6499", "", ""}, {"9112", "", ""}, {"9625", "", ""}, {"3188", "", ""}, {"3626", "", ""},
                {"0429", "", ""}, {"1537", "", ""}, {"7552", "", ""}, {"9206", "", ""}, {"2497", "", ""},
                {"2505", "", ""}, {"1370", "", ""}, {"1438", "", ""}, {"5567", "", ""}, {"1827", "", ""},
                {"9988", "", ""}, {"2066", "", ""}, {"5770", "", ""}, {"0026", "", ""}, {"9646", "", ""},
                {"5063", "", ""}, {"0344", "", ""}, {"3585", "", ""}, {"2609", "", ""}, {"9592", "", ""},
                {"1253", "", ""}, {"1378", "", ""}, {"7884", "", ""}, {"1846", "", ""}, {"2380", "", ""},
                {"5818", "", ""}, {"6424", "", ""}, {"9410", "", ""}, {"1257", "", ""}, {"2362", "", ""},
                {"8864", "", ""}, {"2377", "", ""}, {"0654", "", ""}, {"3911", "", ""}, {"9600", "", ""},
                {"1076", "", ""}, {"2203", "", ""}, {"6901", "", ""}, {"5479", "", ""}, {"1100", "", ""},
                {"7167", "", ""}, {"1283", "", ""}, {"2110", "", ""}, {"4803", "", ""}, {"2210", "", ""},
                {"5684", "", ""}, {"5850", "", ""}, {"8751", "", ""}, {"4080", "", ""}, {"6670", "", ""},
                {"7510", "", ""}
        };

        return real_card_parameters;
    }
    /* Хранение и выдача значений некоторых параметров карт из "боевой" базы данных */


    /* Хранение и выдача информации о печатных билетах из "боевой" базы данных */
    public String[][] getRealTickets()
    {
        // 0 - дата поездки
        // 1 - время поездки
        // 2 - номер терминала
        // 3 - номер транзакции
        // 4 - тип (Транспортная карта / банковская карта / наличные)
        // 5 - город
        // 6 - статус (OK / FISCALIZATION_PROGRESS / CONTACT_CARRIER / NOT_REQUIRED)
        String[][] real_tickets = {
                {"30.10.2021", "18:17:43", "T100232", "1562841287", "TrCard", "Новосибирск", "CC"},
                {"30.10.2021", "19:31:16", "T020686", "2025147056", "TrCard", "Новосибирск", "OK"},

                {"27.10.2021", "13:38:08", "T020186", "1894496323", "CredCard", "Новосибирск", "OK"},
                {"27.10.2021", "15:28:50", "T020350", "1408679927", "CredCard", "Новосибирск", "OK"},
                {"15.12.2021", "11:30:14", "T020615", "1643054332", "CredCard", "Новосибирск", "OK"},
                {"15.12.2021", "15:53:24", "T098647", "1435514199", "CredCard", "Новосибирск", "OK"},

                {"30.10.2021", "14:27:28", "T020636", "1318624581", "Cash", "Новосибирск", "OK"},
                {"31.12.2021", "14:16:57", "T020638", "298319558", "Cash", "Новосибирск", "OK"},
                {"11.01.2022", "10:03:43", "T020686", "427331340", "Cash", "Новосибирск", "OK"}
        };

        return real_tickets;
    }
    /* Хранение и выдача информации о печатных билетах из "боевой" базы данных */


    /* Хранение и выдача информации о печатных билетах из тестовой базы данных TK-Punk */
    public String[][] getTKPunkTickets()
    {
        // 0 - дата поездки
        // 1 - время поездки
        // 2 - номер терминала
        // 3 - номер транзакции
        // 4 - тип (Транспортная карта / банковская карта / наличные)
        // 5 - город
        // 6 - статус (OK / FISCALIZATION_PROGRESS / CONTACT_CARRIER / NOT_REQUIRED)
        String[][] tkpunk_tickets = {
                {"21.10.2021", "13:39:56", "T001646", "1254382617", "TrCard", "Новосибирск", "NR"},
                {"20.10.2021", "14:50:32", "T000838", "1127161976", "TrCard", "Новосибирск", "FP"},
                {"18.10.2021", "15:29:06", "T001063", "1869331647", "TrCard", "Новосибирск", "NR"},
                {"08.10.2021", "17:12:39", "T000827", "268", "TrCard", "Новосибирск", "FP"},
                {"04.10.2021", "15:48:41", "T001720", "466075434", "TrCard", "Новосибирск", "FP"},
                {"24.09.2021", "13:23:18", "T000827", "20", "TrCard", "Новосибирск", "FP"},
                {"16.09.2021", "17:11:19", "T000889", "1338500767", "TrCard", "Новосибирск", "CC"},
                {"09.09.2021", "18:35:06", "T000889", "2000608275", "TrCard", "Новосибирск", "CC"},
                {"06.09.2021", "18:38:40", "T001064", "1602691147", "TrCard", "Новосибирск", "NR"},
                {"02.09.2021", "11:28:17", "T000827", "247", "TrCard", "Новосибирск", "FP"},

                {"25.10.2021", "18:13:29", "T000838", "401058038", "CredCard", "Новосибирск", "FP"},
                {"19.10.2021", "11:01:58", "T001646", "1152829715", "CredCard", "Новосибирск", "FP"},
                {"15.10.2021", "18:38:39", "T001646", "1938823709", "CredCard", "Новосибирск", "NR"},
                {"12.10.2021", "16:44:33", "T001720", "1191949207", "CredCard", "Новосибирск", "FP"},
                {"24.09.2021", "16:56:15", "T001720", "1030887846", "CredCard", "Новосибирск", "FP"},
                {"07.09.2021", "10:15:57", "T000889", "186037138", "CredCard", "Новосибирск", "CC"},
                {"03.09.2021", "09:32:47", "T000889", "1828874490", "CredCard", "Новосибирск", "CC"},
                {"30.07.2021", "16:31:59", "T001646", "25089633", "CredCard", "Новосибирск", "FP"},
                {"18.06.2019", "16:57:28", "J001076", "6215058436", "CredCard", "Новосибирск", "NR"},
                {"24.01.2019", "14:01:14", "T000918", "9999", "CredCard", "Новосибирск", "NR"},

                {"15.10.2021", "18:40:31", "T001646", "579743147", "Cash", "Новосибирск", "FP"},
                {"29.09.2021", "12:41:15", "T001720", "719597071", "Cash", "Новосибирск", "FP"},
                {"10.09.2021", "18:17:10", "T001646", "1320021836", "Cash", "Новосибирск", "NR"},
                {"08.09.2021", "15:09:53", "T000889", "1487342433", "Cash", "Новосибирск", "CC"},
                {"01.09.2021", "17:26:42", "T001744", "449941755", "Cash", "Новосибирск", "CC"},
                {"26.08.2021", "08:37:40", "T000889", "902686742", "Cash", "Новосибирск", "CC"},
                {"26.08.2021", "08:01:51", "T000889", "1948278711", "Cash", "Новосибирск", "CC"},
                {"22.03.2021", "15:06:45", "T001646", "259997894", "Cash", "Новосибирск", "FP"},
                {"12.03.2021", "15:13:10", "T001712", "28167551", "Cash", "Новосибирск", "FP"},
                {"19.02.2021", "17:14:06", "T000838", "691638093", "Cash", "Новосибирск", "FP"}
        };

        return tkpunk_tickets;
    }
    /* Хранение и выдача информации о печатных билетах из тестовой базы данных TK-Punk */


    /* Хранение и выдача информации о рулонных билетах из тестовой базы данных TK-Punk */
    public String[][] getTKPunkRollTickets()
    {
        // 0 - номер рулонного билета
        // 1 - серия рулонного билета
        // 2 - ИНН перевозчика
        // 3 - город
        // 4 - статус (OK / FISCALIZATION_PROGRESS / CONTACT_CARRIER / NOT_REQUIRED)
        String[][] tkpunk_roll_tickets = {
                {"000390", "0731", "5406119655", "Новосибирск", "CC"},
                {"000444", "0731", "5406119655", "Новосибирск", "CC"},
                {"000234", "HAZ001", "07999666999", "Новосибирск", "CC"},
                {"000103", "HAZ001", "07999666999", "Новосибирск", "CC"},
                {"000123", "HAZ001", "07999666999", "Новосибирск", "CC"},
                {"000200", "HAZ001", "07999666999", "Новосибирск", "CC"},
                {"000128", "DEMO01", "5406119655", "Новосибирск", "FP"},
                {"000090", "DEMO01", "5406119655", "Новосибирск", "FP"},
                {"000070", "DEMO07", "5406119655", "Новосибирск", "FP"},
                {"000075", "DEMO07", "5406119655", "Новосибирск", "FP"}
        };

        return tkpunk_roll_tickets;
    }
    /* Хранение и выдача информации о рулонных билетах из тестовой базы данных TK-Punk */

}
